Hyooki/STM32DUINO_GAMEPAD/variants/pindefinition_examples/Official STM32F469I-DISCO.c

enum {
//*=default , +=alternate
//PIN    |BOARD LABEL                             |I2C1|I2C2|I2C3|SPI1 |SPI2 |SPI3 |SPI4 |SPI5 |SPI6 |USART1|USART2|USART3|USART6|ADC1 |TIM (PWM)                                 |USB       |SDIO|RCC       |SYS        
PA0 , // |WAKEUP [B2]                             |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN0 |+TIM2_CH1 *TIM5_CH1                       |          |    |          |           
PA1 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN1 |+TIM2_CH2 *TIM5_CH2                       |          |    |          |           
PA2 , // |                                        |    |    |    |     |     |     |     |     |     |      |+TX   |      |      |*IN2 |+TIM9_CH1 *TIM2_CH3 +TIM5_CH3             |          |    |          |           
PA3 , // |LCD_BL_CTRL [STLD40DPUR_EN]             |    |    |    |     |     |     |     |     |     |      |+RX   |      |      |*IN3 |*TIM2_CH4 +TIM5_CH4 +TIM9_CH2             |          |    |          |           
PA4 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN4 |                                          |          |    |          |           
PA5 , // |                                        |    |    |    |+SCK |     |     |     |     |     |      |      |      |      |*IN5 |+TIM8_CH1N +TIM2_CH1                      |          |    |          |           
PA6 , // |                                        |    |    |    |+MISO|     |     |     |     |     |      |      |      |      |*IN6 |+TIM3_CH1 +TIM13_CH1                      |          |    |          |           
PA7 , // |                                        |    |    |    |+MOSI|     |     |     |     |     |      |      |      |      |*IN7 |+TIM8_CH1N +TIM14_CH1 +TIM3_CH2 +TIM1_CH1N|          |    |          |           
PA8 , // |                                        |    |    |*SCL|     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH1                                 |          |    |          |           
PA9 , // |VBUS_FS1                                |    |    |    |     |+SCK |     |     |     |     |+TX   |      |      |      |     |*TIM1_CH2                                 |          |    |          |           
PA10, // |USB_FS1_ID                              |    |    |    |     |     |     |     |     |     |+RX   |      |      |      |     |*TIM1_CH3                                 |          |    |          |           
PA11, // |USB_FS1_N                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM1_CH4                                 |*OTG_FS_DM|    |          |           
PA12, // |USB_FS1_P                               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |*OTG_FS_DP|    |          |           
PA13, // |SWDIO                                   |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTMS-SWDIO
PA14, // |SWCLK                                   |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*JTCK-SWCLK
PA15, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM2_CH1                                 |          |    |          |*JTDI      
PB0 , // |EXT_RESET                               |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN8 |+TIM8_CH2N +TIM3_CH3 *TIM1_CH2N           |          |    |          |           
PB1 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN9 |+TIM3_CH4 *TIM1_CH3N +TIM8_CH3N           |          |    |          |           
PB2 , // |OTG_FS1_PowerSwitchOn [STMPS2151STR_En] |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB3 , // |I2S3_CK                                 |    |    |    |*SCK |     |*SCK |     |     |     |      |      |      |      |     |*TIM2_CH2                                 |          |    |          |*JTDO-SWO  
PB4 , // |                                        |    |    |    |*MISO|     |*MISO|     |     |     |      |      |      |      |     |*TIM3_CH1                                 |          |    |          |*JTRST     
PB5 , // |                                        |    |    |    |*MOSI|     |*MOSI|     |     |     |      |      |      |      |     |*TIM3_CH2                                 |          |    |          |           
PB6 , // |QSPI_BK1_NCS [N25Q128A13EF840F_S]       |+SCL|    |    |     |     |     |     |     |     |*TX   |      |      |      |     |*TIM4_CH1                                 |          |    |          |           
PB7 , // |OTG_FS1_OverCurrent [STMPS2151STR_FAULT]|+SDA|    |    |     |     |     |     |     |     |*RX   |      |      |      |     |*TIM4_CH2                                 |          |    |          |           
PB8 , // |I2C1_SCL                                |*SCL|    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM10_CH1 *TIM4_CH3                      |          |*D4 |          |           
PB9 , // |I2C1_SDA                                |*SDA|    |    |     |     |     |     |     |     |      |      |      |      |     |*TIM11_CH1 *TIM4_CH4                      |          |*D5 |          |           
PB10, // |STLK_RX [STLINK V2-1_U2_RX]             |    |+SCL|    |     |+SCK |     |     |     |     |      |      |+TX   |      |     |+TIM2_CH3                                 |          |    |          |           
PB11, // |STLK_TX [STLINK V2-1_U2_TX]             |    |+SDA|    |     |     |     |     |     |     |      |      |+RX   |      |     |+TIM2_CH4                                 |          |    |          |           
PB12, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PB13, // |                                        |    |    |    |     |+SCK |     |     |     |     |      |      |      |      |     |*TIM1_CH1N                                |          |    |          |           
PB14, // |                                        |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |     |+TIM12_CH1 +TIM8_CH2N +TIM1_CH2N          |*OTG_HS_DM|    |          |           
PB15, // |                                        |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |     |+TIM12_CH2 +TIM1_CH3N +TIM8_CH3N          |*OTG_HS_DP|    |          |           
PC0 , // |SDNWE [MT48LC4M32B2B5-6A_WE]            |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN10|                                          |          |    |          |           
PC1 , // |                                        |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN11|                                          |          |    |          |+TRACED0   
PC2 , // |                                        |    |    |    |     |+MISO|     |     |     |     |      |      |      |      |*IN12|                                          |          |    |          |           
PC3 , // |                                        |    |    |    |     |+MOSI|     |     |     |     |      |      |      |      |*IN13|                                          |          |    |          |           
PC4 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN14|                                          |          |    |          |           
PC5 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |*IN15|                                          |          |    |          |           
PC6 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |+TX   |     |+TIM8_CH1 +TIM3_CH1                       |          |*D6 |          |           
PC7 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |+RX   |     |+TIM8_CH2 +TIM3_CH2                       |          |*D7 |          |           
PC8 , // |uSD_D0                                  |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH3 *TIM3_CH3                       |          |*D0 |          |+TRACED1   
PC9 , // |uSD_D1                                  |    |    |*SDA|     |     |     |     |     |     |      |      |      |      |     |+TIM8_CH4 *TIM3_CH4                       |          |*D1 |          |           
PC10, // |uSD_D2                                  |    |    |    |     |     |+SCK |     |     |     |      |      |*TX   |      |     |                                          |          |*D2 |          |           
PC11, // |uSD_D3                                  |    |    |    |     |     |+MISO|     |     |     |      |      |*RX   |      |     |                                          |          |*D3 |          |           
PC12, // |uSD_CLK                                 |    |    |    |     |     |+MOSI|     |     |     |      |      |      |      |     |                                          |          |*CK |          |*TRACED3   
PC13, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PC14, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_IN |           
PC15, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |*OSC32_OUT|           
PD0 , // |D2                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD1 , // |D3                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD2 , // |uSD_CMD                                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |*CMD|          |+TRACED2   
PD3 , // |                                        |    |    |    |     |*SCK |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD4 , // |LED2 [Orange]                           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD5 , // |LED3 [Red]                              |    |    |    |     |     |     |     |     |     |      |*TX   |      |      |     |                                          |          |    |          |           
PD6 , // |MIC_DATA [MP34DT01TR_DOUT]              |    |    |    |     |     |+MOSI|     |     |     |      |*RX   |      |      |     |                                          |          |    |          |           
PD7 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD8 , // |D13                                     |    |    |    |     |     |     |     |     |     |      |      |+TX   |      |     |                                          |          |    |          |           
PD9 , // |D14                                     |    |    |    |     |     |     |     |     |     |      |      |+RX   |      |     |                                          |          |    |          |           
PD10, // |D15                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD11, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PD12, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH1                                 |          |    |          |           
PD13, // |MIC_CK [MP34DT01TR_CLK]                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH2                                 |          |    |          |           
PD14, // |D0                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH3                                 |          |    |          |           
PD15, // |D1                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM4_CH4                                 |          |    |          |           
PE0 , // |FMC_NBL0 [ MT48LC4M32B2B5-6A_DQM0]      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE1 , // |FMC_NBL1 [ MT48LC4M32B2B5-6A_DQM1]      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE2 , // |AUDIO_RST [CS43L22_RESET]               |    |    |    |     |     |     |*SCK |     |     |      |      |      |      |     |                                          |          |    |          |*TRACECLK  
PE3 , // |SPKR/HP [CS43L22_SPKR/HP]               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED0   
PE4 , // |SAI1_FSA [CS43L22_LRCK]                 |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |*TRACED1   
PE5 , // |SAI1_SCKA [CS43L22_CLK]                 |    |    |    |     |     |     |*MISO|     |     |      |      |      |      |     |*TIM9_CH1                                 |          |    |          |*TRACED2   
PE6 , // |                                        |    |    |    |     |     |     |*MOSI|     |     |      |      |      |      |     |*TIM9_CH2                                 |          |    |          |+TRACED3   
PE7 , // |D4                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PE8 , // |D5                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1N                                |          |    |          |           
PE9 , // |D6                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH1                                 |          |    |          |           
PE10, // |D7                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2N                                |          |    |          |           
PE11, // |D8                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM1_CH2                                 |          |    |          |           
PE12, // |D9                                      |    |    |    |     |     |     |+SCK |     |     |      |      |      |      |     |+TIM1_CH3N                                |          |    |          |           
PE13, // |D10                                     |    |    |    |     |     |     |+MISO|     |     |      |      |      |      |     |+TIM1_CH3                                 |          |    |          |           
PE14, // |D11                                     |    |    |    |     |     |     |+MOSI|     |     |      |      |      |      |     |+TIM1_CH4                                 |          |    |          |           
PE15, // |D12                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF0 , // |A0                                      |    |*SDA|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF1 , // |A1                                      |    |*SCL|    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF2 , // |A2                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF3 , // |A3                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF4 , // |A4                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF5 , // |A5                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF6 , // |QSPI_BK1_IO3 [N25Q128A13EF840F_DQ3]     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |+TIM10_CH1                                |          |    |          |           
PF7 , // |QSPI_BK1_IO2 [N25Q128A13EF840F_DQ2]     |    |    |    |     |     |     |     |*SCK |     |      |      |      |      |     |+TIM11_CH1                                |          |    |          |           
PF8 , // |QSPI_BK1_IO0 [N25Q128A13EF840F_DQ0]     |    |    |    |     |     |     |     |*MISO|     |      |      |      |      |     |*TIM13_CH1                                |          |    |          |           
PF9 , // |QSPI_BK1_IO1 [N25Q128A13EF840F_DQ1]     |    |    |    |     |     |     |     |*MOSI|     |      |      |      |      |     |*TIM14_CH1                                |          |    |          |           
PF10, // |QSPI_CLK [N25Q128A13EF840F_C]           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF11, // |SDNMT48LC4M32B2B5-6A_RAS]RAS [          |    |    |    |     |     |     |     |+MOSI|     |      |      |      |      |     |                                          |          |    |          |           
PF12, // |A6                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF13, // |A7                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF14, // |A8                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PF15, // |A9                                      |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG0 , // |A10                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG1 , // |A11                                     |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG2 , // |uSD_Detect                              |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG3 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG4 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG5 , // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG6 , // |LED1 [Green]                            |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG7 , // |SAI1_MCLKA [CS43L22_MCLK]               |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG8 , // |SDCLK [MT48LC4M32B2B5-6A_CLK]           |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG9 , // |USART6_RX                               |    |    |    |     |     |     |     |     |     |      |      |      |*RX   |     |                                          |          |    |          |           
PG10, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
PG11, // |                                        |    |    |    |     |     |     |     |     |     |      |      |      |      |     |                                          |          |    |          |           
